 SORTING AND SUBSETTING

 Complete all following Task:

 • Dataset for the Task: "titanic.csv"
 Following task is common for all the problem:
 1. Load the provided dataset and import in pandas DataFrame.

In [63]:
import pandas as pd

In [64]:
file_path = "/content/drive/MyDrive/Concept and technologies of AI/titanic.csv"
titanic_data = pd.read_csv(file_path)

print(titanic_data.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

2. Check info of the DataFrame and identify following:

In [65]:
import pandas as pd

file_path = "/content/drive/MyDrive/Concept and technologies of AI/titanic.csv"
# The pd.read_csv function is used to read the data from the CSV file into a DataFrame.
titanic_data = pd.read_csv(file_path)
# print(data_frame)
print(titanic_data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

Problem 1 - Sorting:
1. Create a DataFrame called fare that contains only the Fare column of the Titanic dataset. Print the
head of the result.

In [66]:
fare = titanic_data[['Fare']]

print("\nFare DataFrame (head):")
print(fare.head())

Fare DataFrame (head):
      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

2. Create a DataFrame called class age that contains only the Pclass and Age columns of the Titanic
dataset, in that order. Print the head of the result.

In [67]:
class_age = titanic_data[['Pclass', 'Age']]

print("\nClass and Age DataFrame (head):")
print(class_age.head())

Class and Age DataFrame (head):
   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

3. Create a DataFrame called survived gender that contains the Survived and Sex columns of the
Titanic dataset, in that order.Print the head of the result.

In [68]:
survived_gender = titanic_data[['Survived', 'Sex']]

print("\nSurvived and Gender DataFrame (head):")
print(survived_gender.head())

Survived and Gender DataFrame (head):
   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

Problem - 2 - Subsetting:
Complete all the following Task:
Subsetting Rows:
1. Filter the Titanic dataset for cases where the passenger’s fare is greater than 100, assigning it
to fare gt 100.View the printed result.

In [69]:
# Subsetting Rows:
#titanic_data = pd.DataFrame(file_path)
fare_gt_100 = titanic_data[titanic_data['Fare']>100]
print(fare_gt_100.head())

     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked
27       2     19950  263.0000  C23 C25 C27        S
31       0  PC 17569  146.5208          B78        C
88       2     19950  263.0000  C23 C25 C27        S
118      1  PC 17558  247.5208      B58 B60        C
195      0  PC 17569  146.5208          B80        C

2. Filter the Titanic dataset for cases where the passenger’s class (Pclass) is 1, assigning it to
first class.View the printed result.

In [70]:
first_class = titanic_data[titanic_data['Pclass'] == 1]

print("\nPassengers in First Class (Pclass = 1):")
print(first_class)

Passengers in First Class (Pclass = 1):
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
11            12         1       1
23            24         1       1
..           ...       ...     ...
871          872         1       1
872          873         0       1
879          880         1       1
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch    Ticket     Fare        Cabin Embarked
1        0  PC 17599  71.2833          C85        C
3        0    113803  53.1000         C123        S
6        0     17463  51.8625          E46        S
11       0    113783  26.5500         C103        S
23       0    113788  35.5000           A6        S
..     ...       ...      ...          ...      ...
871      1     11751  52.5542          D35        S
872      0       695   5.0000  B51 B53 B55        S
879      1     11767  83.1583          C50        C
887      0    112053  30.0000          B42        S
889      0    111369  30.0000         C148        C

[216 rows x 12 columns]

3. Filter the Titanic dataset for cases where the passenger’s age is less than 18 and the passenger
is female (Sex is "female"), assigning it to female under 18. View the printed result.

In [71]:
#subsetting
female_under_18 = titanic_data[(titanic_data['Sex']=='female')&(titanic_data['Age']<18)]
print(female_under_18.head())

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

Subsetting Rows by Categorical variables:
1. Filter the Titanic dataset for passengers whose Embarked port is either "C" (Cherbourg) or "S"
(Southampton), assigning the result to embarked c or s. View the printed result.

In [72]:
embarked_c_or_s = titanic_data[titanic_data['Embarked'].isin(['C', 'S'])]

print("\nPassengers Embarked at Cherbourg (C) or Southampton (S):")
print(embarked_c_or_s)

Passengers Embarked at Cherbourg (C) or Southampton (S):
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
884          885         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
884                             Sutehall, Mr. Henry Jr    male  25.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
884      0   SOTON/OQ 392076   7.0500   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C

[812 rows x 12 columns]

2. Filter the Titanic dataset for passengers whose Pclass is in the list [1, 2] (indicating first
or second class), assigning the result to first second class.View the printed result.

In [73]:
first_second_class = titanic_data[titanic_data['Pclass'].isin([1, 2])]

print("\nPassengers in First or Second Class (Pclass in [1, 2]):")
print(first_second_class)

Passengers in First or Second Class (Pclass in [1, 2]):
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
9             10         1       2
11            12         1       1
..           ...       ...     ...
880          881         1       2
883          884         0       2
886          887         0       2
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
3        0            113803  53.1000  C123        S
6        0             17463  51.8625   E46        S
9        0            237736  30.0708   NaN        C
11       0            113783  26.5500  C103        S
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
883      0  C.A./SOTON 34068  10.5000   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C

[400 rows x 12 columns]

3.2 Exploratory Data Analysis Practice Exercise - 1.

Warning: Handle missing values in the Age column by filling them with the median age of the dataset before performing the division.

Answer the following questions from Dataset:
Which passenger had the highest fare paid relative to their age?
To answer the question perform following operations:
1. Add a column to the Titanic dataset, fare per year, containing the fare divided by the age of
the passenger(i.e., Fare/Age).

In [74]:
import pandas as pd

file_path = "titanic.csv"
titanic_data = pd.read_csv('/content/drive/MyDrive/Concept and technologies of AI/titanic.csv')
median_age = titanic_data['Age'].median()
titanic_data['Age'].fillna(median_age, inplace=True)

titanic_data['fare per year'] = titanic_data['Fare'] / titanic_data['Age']

# Display the first few rows to check the new column
print("\nDataset with 'fare per year' column:")
print(titanic_data[['Name', 'Age', 'Fare', 'fare per year']].head())

Dataset with 'fare per year' column:
                                                Name   Age     Fare  \
0                            Braund, Mr. Owen Harris  22.0   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  71.2833
2                             Heikkinen, Miss. Laina  26.0   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  53.1000
4                           Allen, Mr. William Henry  35.0   8.0500

   fare per year
0       0.329545
1       1.875876
2       0.304808
3       1.517143
4       0.230000

<ipython-input-74-1da37564883f>:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_data['Age'].fillna(median_age, inplace=True)


2. Subset rows where fare per year is higher than 5, assigning this to high fare age.

In [75]:
# Subset rows where fare per year is higher than 5, assigning it to high_fare_age
high_fare_age = titanic_data[titanic_data['fare per year'] > 5]

print("\nPassengers with fare per year > 5:")
print(high_fare_age[['Name', 'fare per year']].head())

Passengers with fare per year > 5:
                                              Name  fare per year
7                   Palsson, Master. Gosta Leonard      10.537500
16                            Rice, Master. Eugene      14.562500
27                  Fortune, Mr. Charles Alexander      13.842105
31  Spencer, Mrs. William Augustus (Marie Eugenie)       5.232886
43        Laroche, Miss. Simonne Marie Anne Andree      13.859733

3. Sort high fare age by descending fare per year, assigning this to high fare age srt.

In [76]:
# Sort high_fare_age by descending fare per year, assigning it to high_fare_age_srt
high_fare_age_srt = high_fare_age.sort_values(by='fare per year', ascending=False)

print("\nSorted high_fare_age by fare per year(descending):")
print(high_fare_age_srt[['Name', 'fare per year']].head())

Sorted high_fare_age by fare per year(descending):
                                Name  fare per year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000

4. Select only the Name and fare per year columns of high fare age srt and save the result as result.

In [77]:
# Select only the 'Name' and 'fare per year' columns of high_fare_age_srt and save the result
result = high_fare_age_srt[['Name', 'fare per year']]

# Display the result
print("\nResult (Name and fare per year for passengers with fare per year > 5,sorted):")
print(result.head())

Result (Name and fare per year for passengers with fare per year > 5,sorted):
                                Name  fare per year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000

5. Look at the result.

In [78]:
# Display the result (Name and fare per year columns)
print("\nFinal result (Name and fare per year for passengers with fare per year > 5, sorted):")
print(result)

Final result (Name and fare per year for passengers with fare per year > 5, sorted):
                                               Name  fare per year
305                  Allison, Master. Hudson Trevor     164.728261
297                    Allison, Miss. Helen Loraine      75.775000
386                 Goodwin, Master. Sidney Leonard      46.900000
164                    Panula, Master. Eino Viljami      39.687500
183                       Becker, Master. Richard F      39.000000
..                                              ...            ...
348          Coutts, Master. William Loch "William"       5.300000
31   Spencer, Mrs. William Augustus (Marie Eugenie)       5.232886
205                      Strom, Miss. Telma Matilda       5.231250
813              Andersson, Miss. Ebba Iris Alfrida       5.212500
480                  Goodwin, Master. Harold Victor       5.211111

[71 rows x 2 columns]

Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their
class?
To answer the question perform following operations:
1. Add a column to the Titanic dataset, fare per class, containing the fare divided by the passenger
class i.e. Fare / Pclass.

In [79]:
# Add a new column 'fare per class' by dividing Fare by Pclass
titanic_data['fare per class'] = titanic_data['Fare'] / titanic_data['Pclass']

print("\nData with 'fare per class' column:")
print(titanic_data[['Fare', 'Pclass', 'fare per class']].head())

Data with 'fare per class' column:
      Fare  Pclass  fare per class
0   7.2500       3        2.416667
1  71.2833       1       71.283300
2   7.9250       3        2.641667
3  53.1000       1       53.100000
4   8.0500       3        2.683333

2. Subset rows where the passenger is male (Sex is ”male”) and an adult (Age is greater than or equal
to 18), assigning this to adult males.

In [80]:
# Subset rows where the passenger is male (Sex is 'male') and an adult (Age >= 18)
adult_males = titanic_data[(titanic_data['Sex'] == 'male') & (titanic_data['Age'] >= 18)]

print("\nAdult male passengers (Age >= 18):")
print(adult_males[['Name', 'Sex', 'Age', 'Fare', 'Pclass', 'fare per class']].head())

Adult male passengers (Age >= 18):
                              Name   Sex   Age     Fare  Pclass  \
0          Braund, Mr. Owen Harris  male  22.0   7.2500       3
4         Allen, Mr. William Henry  male  35.0   8.0500       3
5                 Moran, Mr. James  male  28.0   8.4583       3
6          McCarthy, Mr. Timothy J  male  54.0  51.8625       1
12  Saundercock, Mr. William Henry  male  20.0   8.0500       3

    fare per class
0         2.416667
4         2.683333
5         2.819433
6        51.862500
12        2.683333

3. Sort adult males by descending fare per class, assigning this to adult males srt.

In [81]:
# Sort adult_males by descending fare per class, assigning it to adult_males_srt
adult_males_srt = adult_males.sort_values(by='fare per class', ascending=False)

print("\nAdult males sorted by descending fare per class:")
print(adult_males_srt[['Name', 'Sex', 'Age', 'Fare', 'Pclass', 'fare per class']].head())

Adult males sorted by descending fare per class:
                                   Name   Sex   Age      Fare  Pclass  \
737              Lesurer, Mr. Gustave J  male  35.0  512.3292       1
679  Cardeza, Mr. Thomas Drake Martinez  male  36.0  512.3292       1
438                   Fortune, Mr. Mark  male  64.0  263.0000       1
27       Fortune, Mr. Charles Alexander  male  19.0  263.0000       1
118            Baxter, Mr. Quigg Edmond  male  24.0  247.5208       1

     fare per class
737        512.3292
679        512.3292
438        263.0000
27         263.0000
118        247.5208

4. Select only the Name, Age, and fare per class columns of adult males sr and save the result
as result.

In [82]:
# Select only the 'Name', 'Age', and 'fare per class' columns of adult_males_srt and save it as result
result = adult_males_srt[['Name', 'Age', 'fare per class']]

print("\nResult (Name, Age, and fare per class for adult males sorted):")
print(result.head())

Result (Name, Age, and fare per class for adult males sorted):
                                   Name   Age  fare per class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
438                   Fortune, Mr. Mark  64.0        263.0000
27       Fortune, Mr. Charles Alexander  19.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208

5. Look at the result.

In [83]:
# Display the final result (Name, Age, and fare per class for adult males sorted)
print("\nFinal result (Name, Age, and fare per class for adult males sorted):")
print(result)

Final result (Name, Age, and fare per class for adult males sorted):
                                   Name   Age  fare per class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
438                   Fortune, Mr. Mark  64.0        263.0000
27       Fortune, Mr. Charles Alexander  19.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208
..                                  ...   ...             ...
806              Andrews, Mr. Thomas Jr  39.0          0.0000
481    Frost, Mr. Anthony Wood "Archie"  28.0          0.0000
413      Cunningham, Mr. Alfred Fleming  28.0          0.0000
466               Campbell, Mr. William  28.0          0.0000
271        Tornquist, Mr. William Henry  25.0          0.0000

[519 rows x 3 columns]

3.3 Exploratory Data Analysis with Group-by Method Practice Exercise:
Based on the dataset Answer the following question:
What percent of the total fare revenue came from each passenger class?
To answer the question perform following operation:
1. Calculate the total Fare paid across all passengers in the Titanic dataset.

In [84]:
# Calculate the total Fare paid across all passengers in the Titanic dataset
total_fare = titanic_data['Fare'].sum()

print("\nTotal fare paid across all passengers in the Titanic dataset:")
print(total_fare)

Total fare paid across all passengers in the Titanic dataset:
28693.9493

2. Subset for passengers in first class (Pclass is 1) and calculate their total fare.

In [85]:
# Subset the dataset for passengers in first class (Pclass is 1)
first_class_passengers = titanic_data[titanic_data['Pclass'] == 1]

total_fare_first_class = first_class_passengers['Fare'].sum()

# Display the total fare for first class passengers
print("\nTotal fare paid by first class passengers:")
print(total_fare_first_class)

Total fare paid by first class passengers:
18177.4125

3. Do the same for second class (Pclass is 2) and third class (Pclass is 3).

In [86]:
# Subset the dataset for passengers in second class (Pclass is 2)
second_class_passengers = titanic_data[titanic_data['Pclass'] == 2]

total_fare_second_class = second_class_passengers['Fare'].sum()

# Display the total fare for second class passengers
print("\nTotal fare paid by second class passengers:")
print(total_fare_second_class)

Total fare paid by second class passengers:
3801.8417

4. Combine the fare totals from first, second, and third classes into a list.

In [87]:
# Subset the dataset for passengers in third class (Pclass is 3)
third_class_passengers = titanic_data[titanic_data['Pclass'] == 3]

total_fare_third_class = third_class_passengers['Fare'].sum()

# Display the total fare for third class passengers
print("\nTotal fare paid by third class passengers:")
print(total_fare_third_class)

Total fare paid by third class passengers:
6714.6951

5. Divide the totals for each class by the overall total fare to get the proportion of fare revenue by class.

In [88]:
# Calculate the proportion of fare revenue for each class
proportion_first_class = total_fare_first_class / total_fare
proportion_second_class = total_fare_second_class / total_fare
proportion_third_class = total_fare_third_class / total_fare

# Display the proportions
print("\nProportion of fare revenue by class:")
print(f"First class: {proportion_first_class * 100:.2f}%")
print(f"Second class: {proportion_second_class * 100:.2f}%")
print(f"Third class: {proportion_third_class * 100:.2f}%")

Proportion of fare revenue by class:
First class: 63.35%
Second class: 13.25%
Third class: 23.40%

To answer the question perform following operation:
1. Create a new column, age group, that categorizes passengers into "child" (age < 18), "adult" (age
18{64), and "senior" (age 65 and above).

In [89]:
# Create a new column 'age group' to categorize passengers
titanic_data['age group'] = titanic_data['Age'].apply(
    lambda age: 'child' if age < 18 else ('adult' if age < 65 else 'senior')
)

print("\nDataset with the 'age group' column:")
print(titanic_data[['Name', 'Age', 'age group']].head())

Dataset with the 'age group' column:
                                                Name   Age age group
0                            Braund, Mr. Owen Harris  22.0     adult
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0     adult
2                             Heikkinen, Miss. Laina  26.0     adult
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0     adult
4                           Allen, Mr. William Henry  35.0     adult

2. Calculate the total number of passengers on the Titanic.

In [90]:
# Calculate the total number of passengers on the Titanic
total_passengers = len(titanic_data)

# Display the result
print("\nTotal number of passengers on the Titanic:")
print(total_passengers)

Total number of passengers on the Titanic:
891

3. Count the number of passengers in each age group.

In [91]:
# Count the number of passengers in each age group
age_group_counts = titanic_data['age group'].value_counts()

# Display the result
print("\nNumber of passengers in each age group:")
print(age_group_counts)

Number of passengers in each age group:
age group
adult     767
child     113
senior     11
Name: count, dtype: int64

4. Divide the count of each age group by the total number of passengers to get the proportion of passengers
in each age group.

In [92]:
# Calculate the proportion of passengers in each age group
age_group_proportions = age_group_counts / total_passengers

# Display the result
print("\nProportion of passengers in each age group:")
print(age_group_proportions)

Proportion of passengers in each age group:
age group
adult     0.860831
child     0.126824
senior    0.012346
Name: count, dtype: float64

5. Display the proportion as a percentage.

In [93]:
# Calculate the proportion as a percentage
age_group_percentage = age_group_proportions * 100

print("\nProportion of passengers in each age group (as a percentage):")
print(age_group_percentage.apply(lambda x: f"{x:.2f}%"))

Proportion of passengers in each age group (as a percentage):
age group
adult     86.08%
child     12.68%
senior     1.23%
Name: count, dtype: object